Table of Contents
 Enum MessageNumber
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Message numbers
[Flags]
[DataContract]
public enum MessageNumber
Fields
[EnumMember] ErrBadWeldMaterialProperty = 67108887
[EnumMember] ErrBoltsTooClose = 67108871
[EnumMember] ErrBoltsTooCloseEdge = 67108872
[EnumMember] ErrContactsAngle = 67108873
[EnumMember] ErrCurveDecreaseFunction = 67108880
[EnumMember] ErrCurveDerivation = 67108881
[EnumMember] ErrCurveFunction = 67108879
[EnumMember] ErrCurveNotSet = 67108882
[EnumMember] ErrCurveZeroPoint = 67108878
[EnumMember] ErrDataObjectNotCreated = 67108866
[EnumMember] ErrIncorrectMaterialEGP = 67108875
[EnumMember] ErrIncorrentMaterialE = 67108874
[EnumMember] ErrNoCrossSectionParameter = 67108870
[EnumMember] ErrNoEquivalentObjectInDataModel = 67108869
[EnumMember] ErrNoInLibrary = 67108886
[EnumMember] ErrNoObjectInOpenModel = 67108867
[EnumMember] ErrNoOpenObject = 67108865
[EnumMember] ErrNoReferenceObjectInOpenModel = 67108868
[EnumMember] ErrOperation = 67108888
[EnumMember] ErrPreloadedBoltGrade = 67108876
[EnumMember] ErrTimeout = 67108885
[EnumMember] ErrValidPolyline = 67108883
[EnumMember] ErrValueOutOfRange = 67108877
[EnumMember] ErrWarningLoad = 67108884
[EnumMember] Error = 67108864
[EnumMember] Information = 16777216
[EnumMember] Reserved = 134217728
[EnumMember] Unspecified = 0
[EnumMember] WarnCurveCount = 33554435
[EnumMember] WarnNoPropertyInData = 33554433
[EnumMember] WarnReinforcementBarsCollision = 33554437
[EnumMember] WarnValueOutOfRange = 33554434
[EnumMember] Warning = 33554432
Fields
 Name |  Description
 [EnumMember] ErrBadWeldMaterialProperty = 67108887
 [EnumMember] ErrBoltsTooClose = 67108871
 [EnumMember] ErrBoltsTooCloseEdge = 67108872
 [EnumMember] ErrContactsAngle = 67108873
 [EnumMember] ErrCurveDecreaseFunction = 67108880
 [EnumMember] ErrCurveDerivation = 67108881
 [EnumMember] ErrCurveFunction = 67108879
 [EnumMember] ErrCurveNotSet = 67108882
 [EnumMember] ErrCurveZeroPoint = 67108878
 [EnumMember] ErrDataObjectNotCreated = 67108866
 [EnumMember] ErrIncorrectMaterialEGP = 67108875
 [EnumMember] ErrIncorrentMaterialE = 67108874
 [EnumMember] ErrNoCrossSectionParameter = 67108870
 [EnumMember] ErrNoEquivalentObjectInDataModel = 67108869
 [EnumMember] ErrNoInLibrary = 67108886
 [EnumMember] ErrNoObjectInOpenModel = 67108867
 [EnumMember] ErrNoOpenObject = 67108865
 [EnumMember] ErrNoReferenceObjectInOpenModel = 67108868
 [EnumMember] ErrOperation = 67108888
 [EnumMember] ErrPreloadedBoltGrade = 67108876
 [EnumMember] ErrTimeout = 67108885
 [EnumMember] ErrValidPolyline = 67108883
 [EnumMember] ErrValueOutOfRange = 67108877
 [EnumMember] ErrWarningLoad = 67108884
 [EnumMember] Error = 67108864
 [EnumMember] Information = 16777216
 [EnumMember] Reserved = 134217728
 [EnumMember] Unspecified = 0
 [EnumMember] WarnCurveCount = 33554435
 [EnumMember] WarnNoPropertyInData = 33554433
 [EnumMember] WarnReinforcementBarsCollision = 33554437
 [EnumMember] WarnValueOutOfRange = 33554434
 [EnumMember] Warning = 33554432
 Edit this page